a5021/stm32-async-1wire/tests/test/test_state_machine.c
/* ============================================================
 *  test_state_machine.c - State Machine Tests
 *
 *  Tests the ds18b20_poll() state machine transitions.
 *  Since poll() checks T1.SR UIF flag, we manipulate the
 *  mock register to simulate hardware completion.
 *
 *  States: IDLE(0) -> START(1) -> CONVERT(2) -> WAIT(3) ->
 *          CONTINUE(4) -> REQUEST(5) -> READ(6) -> DECODE(7) -> IDLE(0)
 * ============================================================ */

#include "ds18b20.h"
#include "ds18b20_test_access.h"
#include "hw_model.h"
#include "stm32f1xx.h"
#include "unity.h"
#include <string.h>

/*-------------------------------------------------------------
 *  Callback spy for ds18b20_complete
 *  Records the last value passed to the callback
 * -----------------------------------------------------------*/
static int16_t spy_complete_value;
static int spy_complete_called;

/* Busy-indicator spy: records the last ds18b20_busy() action. */
static int spy_busy_calls;
static unsigned spy_busy_last_action;

void ds18b20_complete(int16_t temp) {
    spy_complete_value = temp;
    spy_complete_called = 1;
}

void spy_reset(void) {
    spy_complete_value = 0;
    spy_complete_called = 0;
    spy_busy_calls = 0;
    spy_busy_last_action = 0;
}

/*-------------------------------------------------------------
 *  Test: Initial state after ds18b20_init()
 * -----------------------------------------------------------*/
void test_state_machine_initial_state_after_init(void) {
    /* Initialize the driver */
    ds18b20_init();

    /* State should be 0 (IDLE) and UIF should be set */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: First poll transitions IDLE -> START -> CONVERT
 *  (with UIF set, simulates hardware completion)
 * -----------------------------------------------------------*/
void test_state_machine_first_poll_transitions_to_START(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Simulate UIF set (hardware operation complete) */
    mock_tim1.SR |= TIM_SR_UIF;

    /* First poll: IDLE(0) -> START(1) */
    ds18b20_poll();

    /* State should now be 2 (CONVERT) because START falls through */
    TEST_ASSERT_EQUAL_UINT8(2, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: UIF clear means poll returns immediately
 * -----------------------------------------------------------*/
void test_state_machine_UIF_clear_no_transition(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* UIF is NOT set */
    mock_tim1.SR &= ~TIM_SR_UIF;

    /* Poll should return immediately without changing state */
    uint8_t state_before = ds18b20_test_get_state();
    ds18b20_poll();
    uint8_t state_after = ds18b20_test_get_state();

    TEST_ASSERT_EQUAL_UINT8(state_before, state_after);
}

/*-------------------------------------------------------------
 *  Test: CONVERT state with presence check pass
 * -----------------------------------------------------------*/
void test_state_machine_convert_with_presence_pass(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to CONVERT */
    ds18b20_test_set_state(2);

    /* Set presence edges to valid values */
    ds18b20_test_set_edge(0, 510); /* Reset pulse within range */
    ds18b20_test_set_edge(1, 700); /* Presence pulse within range */

    /* Simulate UIF set */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should send convert command and transition to WAIT */
    ds18b20_poll();

    TEST_ASSERT_EQUAL_UINT8(3, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: CONVERT state with presence check fail
 * -----------------------------------------------------------*/
void test_state_machine_convert_with_presence_fail(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to CONVERT */
    ds18b20_test_set_state(2);

    /* Set presence edges to invalid values (device not present) */
    ds18b20_test_set_edge(0, 100); /* Too short */
    ds18b20_test_set_edge(1, 100); /* Too short */

    /* Simulate UIF set */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should report NO_SENSOR error and go to pause */
    ds18b20_poll();

    /* After failure, state goes back to IDLE (0) with pause timer running */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
    /* Busy indicator must be cleared even though DECODE was skipped. */
    TEST_ASSERT_EQUAL_UINT8(0, spy_busy_last_action);
}

/*-------------------------------------------------------------
 *  Test: WAIT state transitions to CONTINUE
 * -----------------------------------------------------------*/
void test_state_machine_wait_transitions_to_continue(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to WAIT */
    ds18b20_test_set_state(3);

    /* Simulate UIF set (750ms timer complete) */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should reset bus and transition to CONTINUE */
    ds18b20_poll();

    TEST_ASSERT_EQUAL_UINT8(4, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: CONTINUE state transitions to REQUEST
 * -----------------------------------------------------------*/
void test_state_machine_continue_transitions_to_request(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to CONTINUE */
    ds18b20_test_set_state(4);

    /* Simulate UIF set (reset complete) */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should check presence and transition to REQUEST */
    ds18b20_poll();

    /* With default edges (0), presence check fails -> goes to IDLE */
    /* To test successful path, we need valid edges */
    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);

    /* Reset state to CONTINUE and try again */
    ds18b20_test_set_state(4);
    mock_tim1.SR |= TIM_SR_UIF;

    ds18b20_poll();

    TEST_ASSERT_EQUAL_UINT8(5, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: REQUEST state with presence check pass
 * -----------------------------------------------------------*/
void test_state_machine_request_with_presence_pass(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to REQUEST */
    ds18b20_test_set_state(5);

    /* Set valid presence edges */
    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);

    /* Simulate UIF set */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should send read command and transition to READ */
    ds18b20_poll();

    TEST_ASSERT_EQUAL_UINT8(6, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: READ state transitions to DECODE
 * -----------------------------------------------------------*/
void test_state_machine_read_transitions_to_decode(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

