a5021/stm32-async-1wire/tests/test/test_state_machine.c
    /* All-0xFF scratchpad: simulate a bus that nobody drives after the
     * Match ROM address (undriven line reads back as all '1' bits) */
    for (int i = 0; i < 9; i++) {
        for (int b = 0; b < 8; b++) {
            ds18b20_test_set_pulse(i * 8 + b, 5u);
        }
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    /* Must be NO_SENSOR, not a bogus CRC error */
    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_NO_SENSOR, spy_complete_value);

    /* State should return to IDLE */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: DECODE with corrupted (non 0xFF) scratchpad in Match ROM
 *  mode still reports CRC error (B2 heuristic must not swallow
 *  genuine communication corruption)
 * -----------------------------------------------------------*/
void test_state_machine_decode_corrupt_match_rom_reports_crc(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Enable Match ROM addressing (a device is selected) */
    uint8_t rom[8] = {0x28, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07};
    ds18b20_select(rom);

    /* Set state to DECODE */
    ds18b20_test_set_state(7);

    /* Scratchpad that is NOT all 0xFF but fails the reserved-byte check */
    uint8_t bad_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0x00, 0x08, 0x10, 0x10};
    for (int i = 0; i < 9; i++) {
        for (int b = 0; b < 8; b++) {
            ds18b20_test_set_pulse(i * 8 + b, (bad_data[i] >> b) & 1u ? 5u : 60u);
        }
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    /* Must remain a CRC error */
    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_CRC_FAIL, spy_complete_value);

    /* State should return to IDLE */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}
void test_state_machine_decode_wrong_byte5_reports_error(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to DECODE */
    ds18b20_test_set_state(7);

    /* Set up scratchpad with byte 5 = 0x00 (should be 0xFF) */
    uint8_t bad_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0x00, 0x08, 0x10, 0x10};
    for (int i = 0; i < 9; i++) {
        ds18b20_test_set_scratchpad(i, bad_data[i]);
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    /* Callback must be called with CRC error */
    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_CRC_FAIL, spy_complete_value);

    /* State should return to IDLE */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  E2E: bus search finds one device, select it (Match ROM),
 *  then run the full measurement cycle and get a temperature.
 * -----------------------------------------------------------*/
#define E2E_ONE 5u
#define E2E_ZERO 60u

static uint8_t g_e2e_rom[8];
static uint8_t g_e2e_wr_bit;

static uint8_t e2e_sink(const uint8_t* rom) {
    memcpy(g_e2e_rom, rom, 8);
    return 0;
}

static uint16_t e2e_capture_src(uint32_t idx) {
    uint8_t rcr = (uint8_t)mock_tim1.RCR;
    if (rcr == 0) {
        return idx == 0 ? 510u : 700u; /* reset + presence pulse */
    }
    if (rcr == 1) { /* first read pair: bit 1 */
        uint8_t b = (g_e2e_rom[0] >> 0) & 1u;
        return (idx == 0) ? (b ? E2E_ONE : E2E_ZERO) : (b ? E2E_ZERO : E2E_ONE);
    }
    /* merged write+read capturing bit g_e2e_wr_bit */
    uint8_t byte = (g_e2e_wr_bit - 1u) / 8u;
    uint8_t bit = (g_e2e_wr_bit - 1u) % 8u;
    uint8_t b = (g_e2e_rom[byte] >> bit) & 1u;
    if (idx == 0) return 0u;
    if (idx == 1) return b ? E2E_ONE : E2E_ZERO;
    g_e2e_wr_bit++;
    return b ? E2E_ZERO : E2E_ONE;
}

void test_state_machine_search_select_measure_e2e(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Phase 1: bus search finds exactly one device */
    uint8_t serial[7] = {0x28, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06};
    memcpy(g_e2e_rom, serial, 7);
    g_e2e_rom[7] = ds18b20_crc8(g_e2e_rom, 7);

    g_e2e_wr_bit = 2;
    hw_set_capture_source(e2e_capture_src);
    ds18b20_search_start(e2e_sink, 1);

    uint16_t guard = 0;
    for (;;) {
        if (ds18b20_search_poll()) {
            break;
        }
        if (mock_tim1.CR1 & TIM_CR1_CEN) {
            uint8_t ok = hw_run_until_uif(100);
            TEST_ASSERT_TRUE(ok);
        }
        if (++guard > 500) {
            break;
        }
    }
    TEST_ASSERT_TRUE(guard <= 500);
    TEST_ASSERT_EQUAL_UINT8(1, ds18b20_search_count());
    TEST_ASSERT_EQUAL_UINT8(1, ds18b20_search_poll()); /* finished flag */

    /* Phase 2: select the found device -> Match ROM addressing */
    ds18b20_select(g_e2e_rom);
    TEST_ASSERT_EQUAL_UINT8(1, ds18b20_test_get_address_mode());

    /* Phase 3: full measurement cycle in Match ROM mode */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(2, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(3, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(4, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(5, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(6, ds18b20_test_get_state());

    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0};
    temp_data[8] = ds18b20_crc8(temp_data, 8);
    for (int i = 0; i < 9; i++) {
        for (int b = 0; b < 8; b++) {
            ds18b20_test_set_pulse(i * 8 + b,
                                   (temp_data[i] >> b) & 1u ? E2E_ONE : E2E_ZERO);
        }
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(7, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

