a5021/stm32-async-1wire/tests/test/test_state_machine.c
    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(223, spy_complete_value);
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: ds18b20_init() configures clocks, prescaler and GPIO
 * -----------------------------------------------------------*/
void test_state_machine_init_configures_registers(void) {
    hw_reset_all();
    ds18b20_init();

    TEST_ASSERT_BITS_HIGH(RCC_APB2ENR_IOPAEN | RCC_APB2ENR_TIM1EN, mock_rcc.APB2ENR);
    TEST_ASSERT_BITS_HIGH(RCC_AHBENR_DMA1EN, mock_rcc.AHBENR);
    TEST_ASSERT_EQUAL_UINT32(71, mock_tim1.PSC); /* 72MHz/72 = 1MHz -> 1us */
    TEST_ASSERT_BITS_HIGH(TIM_BDTR_MOE, mock_tim1.BDTR);
    TEST_ASSERT_BITS_HIGH(GPIO_CRH_CNF8_0 | GPIO_CRH_CNF8_1 | GPIO_CRH_MODE8_1, mock_gpioa.CRH);
}

/*-------------------------------------------------------------
 *  Test: ds18b20_busy() spy - START sets busy, DECODE clears it
 * -----------------------------------------------------------*/
void ds18b20_busy(unsigned action) {
    spy_busy_calls++;
    spy_busy_last_action = action;
}

void test_state_machine_busy_spy(void) {
    spy_reset();
    spy_busy_calls = 0;
    spy_busy_last_action = 0;
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* IDLE -> START -> CONVERT: busy(1) at START */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(1, spy_busy_calls);
    TEST_ASSERT_EQUAL_UINT8(1, spy_busy_last_action);

    /* Decode with valid CRC: busy(0) at DECODE */
    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0};
    temp_data[8] = ds18b20_crc8(temp_data, 8);
    for (int i = 0; i < 9; i++) {
        for (int b = 0; b < 8; b++) {
            ds18b20_test_set_pulse(i * 8 + b,
                                   (temp_data[i] >> b) & 1u ? 5u : 60u);
        }
    }
    ds18b20_test_set_state(7);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    TEST_ASSERT_EQUAL_UINT8(0, spy_busy_last_action);
}

/*-------------------------------------------------------------
 *  Test: NO_SENSOR error in the REQUEST state (after a
 *  successful CONVERT) reports the error and returns to IDLE
 * -----------------------------------------------------------*/
void test_state_machine_request_presence_fail(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    ds18b20_test_set_state(5);
    ds18b20_test_set_edge(0, 100); /* bad reset */
    ds18b20_test_set_edge(1, 100); /* bad presence */

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_NO_SENSOR, spy_complete_value);
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
    /* Busy indicator must be cleared even though DECODE was skipped. */
    TEST_ASSERT_EQUAL_UINT8(0, spy_busy_last_action);
}

/*-------------------------------------------------------------
 *  Test: a presence failure in issue_command (CONVERT state) must
 *  clear the busy indicator. busy(1) is asserted in START; the early
 *  error exit used to skip DECODE (where busy(0) normally lives), so
 *  it must clear busy itself.
 * -----------------------------------------------------------*/
void test_state_machine_presence_fail_clears_busy(void) {
    spy_reset();
    spy_busy_calls = 0;
    spy_busy_last_action = 0;
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* IDLE -> START: busy(1) is asserted, as in a real measurement. */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(1, spy_busy_last_action); /* busy ON */

    /* Now in CONVERT with no device present: issue_command must fail and
     * turn busy OFF before reporting NO_SENSOR. */
    ds18b20_test_set_edge(0, 100); /* bad reset */
    ds18b20_test_set_edge(1, 100); /* bad presence */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_NO_SENSOR, spy_complete_value);
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
    TEST_ASSERT_EQUAL_UINT8(0, spy_busy_last_action); /* busy OFF */
}

/*-------------------------------------------------------------
 *  Test: CRC_FAIL in the middle of a full cycle - CONVERT passes,
 *  then the scratchpad read returns a bad CRC
 * -----------------------------------------------------------*/
void test_state_machine_crc_fail_mid_cycle(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Full cycle with a corrupted scratchpad read */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(2, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(3, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(4, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(5, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(6, ds18b20_test_get_state());

    /* Corrupt the data so the CRC fails */
    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0};
    temp_data[8] = (uint8_t)(ds18b20_crc8(temp_data, 8) ^ 0xFF); /* bad CRC */
    for (int i = 0; i < 9; i++) {
        for (int b = 0; b < 8; b++) {
            ds18b20_test_set_pulse(i * 8 + b,
                                   (temp_data[i] >> b) & 1u ? 5u : 60u);
        }
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(7, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_CRC_FAIL, spy_complete_value);
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: Full Skip-ROM cycle produces the exact temperature
 *  (matches the E2E Match-ROM value; Skip ROM broadcast mode)
 * -----------------------------------------------------------*/
void test_state_machine_full_cycle_skip_rom_value(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();
    ds18b20_test_set_address_mode(0);

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(2, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(3, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(4, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(5, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(6, ds18b20_test_get_state());

    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0};
    temp_data[8] = ds18b20_crc8(temp_data, 8);
    for (int i = 0; i < 9; i++) {
        for (int b = 0; b < 8; b++) {
            ds18b20_test_set_pulse(i * 8 + b,
                                   (temp_data[i] >> b) & 1u ? 5u : 60u);
        }
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(7, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

