a5021/stm32-async-1wire/tests/test/test_state_machine.c
    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(223, spy_complete_value);
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Run all state machine tests
 * -----------------------------------------------------------*/
void run_test_state_machine(void) {
    TEST_RUN(test_state_machine_initial_state_after_init);
    TEST_RUN(test_state_machine_first_poll_transitions_to_START);
    TEST_RUN(test_state_machine_UIF_clear_no_transition);
    TEST_RUN(test_state_machine_convert_with_presence_pass);
    TEST_RUN(test_state_machine_convert_with_presence_fail);
    TEST_RUN(test_state_machine_wait_transitions_to_continue);
    TEST_RUN(test_state_machine_continue_transitions_to_request);
    TEST_RUN(test_state_machine_request_with_presence_pass);
    TEST_RUN(test_state_machine_read_transitions_to_decode);
    TEST_RUN(test_state_machine_decode_with_valid_crc);
    TEST_RUN(test_state_machine_decode_with_invalid_crc);
    TEST_RUN(test_state_machine_invalid_state_triggers_error);
    TEST_RUN(test_state_machine_full_cycle_skip_rom);
    TEST_RUN(test_state_machine_match_rom_mode);
    TEST_RUN(test_state_machine_decode_all_zero_reports_error);
    TEST_RUN(test_state_machine_decode_all_FF_reports_error);
    TEST_RUN(test_state_machine_decode_all_FF_match_rom_reports_no_sensor);
    TEST_RUN(test_state_machine_decode_corrupt_match_rom_reports_crc);
    TEST_RUN(test_state_machine_decode_wrong_byte5_reports_error);
    TEST_RUN(test_state_machine_search_select_measure_e2e);
    TEST_RUN(test_state_machine_init_configures_registers);
    TEST_RUN(test_state_machine_busy_spy);
    TEST_RUN(test_state_machine_request_presence_fail);
    TEST_RUN(test_state_machine_presence_fail_clears_busy);
    TEST_RUN(test_state_machine_crc_fail_mid_cycle);
    TEST_RUN(test_state_machine_full_cycle_skip_rom_value);
}
